# Summary

The DataFrame is the primary data structure in pandas. It is effectively a table of data with multiple columns.

 The Series is a one-dimensional labeled array. Think of it as a single column of data.

 We can access a row in a Series or DataFrame by its row number or index label.

 We can sort a DataFrame by values across one or more columns.

 We can use logical conditions to extract subsets of data from a DataFrame.

 We bucket DataFrame rows based on a column’s values. We can also perform aggregate operations such as sums on the resulting groups.

In [1]:
import pandas as pd

/usr/lib/python3/dist-packages/pytz/__init__.py:31: SyntaxWarning: invalid escape sequence '\s'
  match = re.match("^#\s*version\s*([0-9a-z]*)\s*$", line)

Working with movies file

In [2]:
movies = pd.read_csv('/home/diego/Documents/Data/movies.csv')

In [3]:
movies

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

We can see the index (first column) and then the proper columns of the file

**Remember that read_* returns a DataFrame object**

In [4]:
type(movies)

pandas.core.frame.DataFrame

We will always have a index columns that are labels to identify rows in the DataFrame

**We can set any column as an index**

In [5]:
# In this case, I want to set the column Title as index

movies = pd.read_csv('/home/diego/Documents/Data/movies.csv', index_col='Title')

Now I have a DataFrame with the index column Title

In [6]:
movies

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

We can look for a number of rows from the beginning of the DF

In [7]:
movies.head()

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018

Or from the end

In [8]:
movies.tail()

                          Rank           Studio     Gross  Year
Title
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

to find out **how many rows** our dataframe has just with the len built in function

In [9]:
len(movies)

782

**Number of rows and columns in the DF**

In [10]:
movies.shape

(782, 4)

**How many cells?**

In [11]:
movies.size

3128

**Knowing the Data types of each column

In [12]:
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

Extracting rows from a dataframe

In [13]:
movies.iloc[0]

Rank                1
Studio    Buena Vista
Gross      $2,796.30
Year             2019
Name: Avengers: Endgame, dtype: object

We can access also with the index label with the following syntax: `df.loc['index_value']`

In [14]:
movies.loc['Avengers: Endgame']

Rank                1
Studio    Buena Vista
Gross      $2,796.30
Year             2019
Name: Avengers: Endgame, dtype: object

In [15]:
movies.loc['Forrest Gump']

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

It's the best to have labels with one correspondence
Here the are two record to the label 101 Dalmatians

In [16]:
movies.loc['101 Dalmatians']

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

# An introduction to sort data

What if we are interested in the five movies with the most recent release date?

> inplace
: This parameter takes a `True` or a `False` to make the modification in the original object (if true) and returning None or if False, return a copy with the modifications

In [17]:
# Getting the five latest movies

movies.sort_values(by='Year', ascending=False).head()  # ascending is True by default

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019

We can also sort the DF across multiple columns

In [18]:
# Order alphabetically by studio and by year.
# In this case, the sort is ascending is True for the two columns
movies.sort_values(by=['Studio', 'Year']).head()

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

In [19]:
# Specifying for each columns what order

movies.sort_values(by=['Studio', 'Year'], ascending=[True, False]).head()

                         Rank       Studio       Gross  Year
Title
The Blair Witch Project   588      Artisan    $248.60   1999
Avengers: Endgame           1  Buena Vista  $2,796.30   2019
Captain Marvel             22  Buena Vista  $1,128.30   2019
Aladdin                    59  Buena Vista    $880.20   2019
Toy Story 4               198  Buena Vista    $519.80   2019

We also can sort the index

In [20]:
# in this case I set as index the Title column

movies.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

I want to answer:

**Which movie studio had the greatest number of highest-grossing films?**

Notice that `df['<name>']` return a Series with the index and the column of interest

In [21]:
# I need to count the number of times each studio appears in the Studio column

# Extracting one column
movies['Studio']

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

Now counting the number of occurrences of each studio

In [22]:
movies['Studio'].value_counts()

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
MGM                        11
TriStar                    11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Polygram                    2
Orion                       2
SonR                        2
Dimension                   2
Vestron                     1
USA                         1
Lions                       1
Focus                       1
Rela.                       1
CL                          1
Pathe                       1
Artisan                     1
IFC                         1
GrtIndia                    1
RKO                         1
UTV                         1
FUN                         1
FR                          1
Newmarket                   1
China Film Corporation      1
HC                          1
Magn.                       1
Name: count, dtype: int64

Another way to count the occurrences

It is important to notice that this returns a Series object, So we have the index column now as Studio and the values the count column

**Hence we just have the Series's values (count) and its labels (Studio)**

In [23]:
movies.value_counts('Studio')

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
TriStar                    11
MGM                        11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Orion                       2
Dimension                   2
Polygram                    2
SonR                        2
IFC                         1
Rela.                       1
CL                          1
Vestron                     1
China Film Corporation      1
UTV                         1
USA                         1
RKO                         1
Lions                       1
Pathe                       1
FR                          1
Newmarket                   1
FUN                         1
Focus                       1
Magn.                       1
GrtIndia                    1
HC                          1
Artisan                     1
Name: count, dtype: int64

# Starting filtering

Extract a subset of rows based on one or more criteria. Like the Excel's filter tool

In [33]:
# Films released by Universal Studios
released_by_universal = movies['Studio']  == 'Universal'  # iterates over the rows to verify the condition, and creates the column with boolean values

df = movies[released_by_universal]  # return a df with the rows that are True in en criteria

df.sort_values('Year')

                                            Rank     Studio     Gross  Year
Title
Jaws                                         228  Universal  $470.70   1975
E.T.: The Extra-Terrestrial                   84  Universal  $792.90   1982
Back to the Future                           311  Universal  $381.10   1985
Out of Africa                                662  Universal  $227.50   1985
Twins                                        704  Universal  $216.60   1988
...                                          ...        ...       ...   ...
Halloween                                    569  Universal  $255.50   2018
Glass                                        591  Universal  $247.00   2019
The Secret Life of Pets 2                    670  Universal  $225.90   2019
How to Train Your Dragon: The Hidden World   199  Universal  $519.80   2019
Us                                           572  Universal  $254.70   2019

[109 rows x 4 columns]

But also we can filter by multiple criteria

In [35]:
released_in_2015 = movies['Year'] == 2015
movies[released_by_universal & released_in_2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [36]:
# Filtering to meet one of the two criteria
movies[released_by_universal | released_in_2015]

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

Also we can target column values less than or greater than a specific value

In [39]:
# movies released before 1975
released_before_1975 = movies['Year'] < 1975
movies[released_before_1975]

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961
The Jungle Book      755      Buena Vista  $205.80   1967

Also it is possible to make a range of values with `between()` method that returns a Series object with boolean values

In [45]:
mid_80s = movies['Year'].between(1983,1986)
movies[mid_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

We can use the index we set for filter data, In this case, we are using the Title colum (because i set it as index column) and with this object we can use the string method in the following way. In the end the `contains` method returns a True or False; hence we will have an array with Boolean values to use as a filter

In [63]:
has_dark_in_title = movies.index.str.lower().str.contains('dark')

In [64]:
movies[has_dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

# Grouping data

This time we are curious which studio had the highest total grosses across all films. We need to aggregate the values of the Gross column by studio

The dilemma here is that the Gross column's data type is a text; we have to convert it to numbers

Remember that the built in `int()` or `float()` can convert string into numbers BUT, only if they are letters, we can't convert a '$' in number, let's remove all these characters

Here `regex` parameter is set to False because in the regular expressions patterns the dolar sign plays a role, so with False we delete that behavior

In [74]:
# removing $ and ,
# docs https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.replace.html
# to convert the type with the method astype()
movies['Gross'].str.replace('$', '', regex=False).str.replace(',', '', regex=False).astype(float)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

**Remember all operations ARE NOT PERMANENT pandas always will work with copies, to do permanent changes we need to do the following**

In [75]:
movies['Gross'] = movies['Gross'].str.replace('$', '', regex=False).str.replace(',', '', regex=False).astype(float)

In [78]:
movies.dtypes

Rank        int64
Studio     object
Gross     float64
Year        int64
dtype: object

Now we can perform more operations with the new data type

In [79]:
movies['Gross'].mean()

439.0308184143222

Now calculating the aggregate gross per studio

In [80]:
movies

                              Rank           Studio   Gross  Year
Title
Avengers: Endgame                1      Buena Vista  2796.3  2019
Avatar                           2              Fox  2789.7  2009
Titanic                          3        Paramount  2187.5  1997
Star Wars: The Force Awakens     4      Buena Vista  2068.2  2015
Avengers: Infinity War           5      Buena Vista  2048.4  2018
...                            ...              ...     ...   ...
Yogi Bear                      778  Warner Brothers   201.6  2010
Garfield: The Movie            779              Fox   200.8  2004
Cats & Dogs                    780  Warner Brothers   200.7  2001
The Hunt for Red October       781        Paramount   200.5  1990
Valkyrie                       782              MGM   200.3  2008

[782 rows x 4 columns]

In [81]:
studios = movies.groupby('Studio')  # this will count movies per studio

In [88]:
studios['Gross'].count().sort_values(ascending=False)

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
TriStar                    11
MGM                        11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Orion                       2
Dimension                   2
Polygram                    2
SonR                        2
IFC                         1
Rela.                       1
CL                          1
Vestron                     1
China Film Corporation      1
UTV                         1
USA                         1
RKO                         1
Lions                       1
Pathe                       1
FR                          1
Newmarket                   1
FUN                         1
Focus                       1
Magn.                       1
GrtIndia                    1
HC                          1
Artisan                     1
Name: Gross, dtype: int64

In [91]:
# Now adding all values of gross per studio
studios['Gross'].sum().sort_values(ascending=False)

Studio
Buena Vista               73585.0
Warner Brothers           58643.8
Fox                       50420.8
Universal                 44302.3
Sony                      32822.5
Paramount                 32486.0
Dreamworks                12260.4
Lionsgate                 10033.2
New Line                   6584.8
MGM                        3513.1
TriStar                    3185.5
Miramax                    2480.6
Weinstein                  2057.7
WGUSA                      1349.1
Columbia                   1276.6
HC                          870.3
China Film Corporation      699.8
Orion                       696.9
Newmarket                   611.9
SonR                        515.1
Polygram                    496.9
Dimension                   488.7
FR                          385.3
IFC                         368.7
FUN                         358.0
UTV                         302.9
RKO                         267.4
GrtIndia                    254.2
Artisan                     248.6
Pathe                       245.1
CL                          228.1
Rela.                       226.9
Lions                       222.4
Vestron                     214.6
USA                         207.5
Focus                       205.8
Magn.                       205.6
Name: Gross, dtype: float64